<?php
   /*
    * 功能：被邀请好友首笔投资 送邀请人现金红包 活动信息配置
    * 时间：2015年08月25日
    *
    */
    return array(
            //被邀请好友投资 送邀请人现金红包  活动配置
            'invit_bid_acting'     => array(
                                            'ACT_STATUS'     => 1,//邀请好友送红包活动状态 1代表活动开启 0代表关闭
                                            'ACT_NAME'            => '被邀请好友投资送邀请人现金红包',//活动名称
                                            'ACT_START_TIME'     => '2015-08-27 00:00:00',//活动开始日期
                                            'ACT_END_TIME'       => '2015-09-27 23:59:59', //活动结束日期
                                            'ACT_RULES' => array(
                                                'ACT_INVEST_RANGE' => '0,100,1000,5000',//被邀请人投资额度阶梯奖励范围
                                                'ACT_REWARD_RANGE' => '1,5,10,15,20',//邀请人获得现金红包范围
                                            ),
                                        ),
    );

