<?php

/*
 * 功能：大转盘送现金红包 活动信息配置
 * 时间：2015年08月25日
 *
 */
return array(
    //大转盘送现金红包  活动配置
    'lottery' => array(
	'ACT_STATUS' => 1, //大转盘送现金红包活动状态 1代表活动开启 0代表关闭
	'ACT_NAME' => '大转盘送现金红包', //活动名称
	'ACT_START_TIME' => '2015-08-28 00:00:00', //活动开始日期
	'ACT_END_TIME' => '2015-09-30 23:59:59', //活动结束日期
	'ACT_BONUS_ID' => array(
	    '1' => 1, // 1元
	    '2' => 2,
	    '3' => 3,
	    '4' => 4,
	    '5' => 5,
	    '6' => 6,
	    '7' => 7,
	    '8' => 8,
	    '9' => 9,
	    '10' => 10,
	),
    ),
);

