<?php

/*
 * 功能：满就送活动信息配置 只要是满特定投资数目或者是其倍数就送现金红包 赠送也是同倍数赠送
 * 时间：2015年08月25日
 *
 */

return array(
            //满10000元送50元  活动配置
            'over_top_acting'     => array(
                                            'ACT_STATUS'     => 1,//满10000元送50元活动状态 1代表活动开启 0代表关闭
                                            'ACT_NAME'            => '满10000元送50元',//活动名称
                                            'ACT_START_TIME'     => '2015-08-27 00:00:00',//活动开始日期
                                            'ACT_END_TIME'       => '2015-09-27 23:59:59', //活动结束日期
                                            'ACT_TOWARDS_START_MONEY' => 10000,//赠送起点金额
                                            'ACT_TOWARDS_MONEY' => 50,//赠送金额倍数
                                            'ACT_IS_MULTIPLE' => 1,//是否按投资倍数累计赠送 0只赠送一次  1 随金额的倍数成倍赠送
                                        )
    );