<?

/*
版本信息
当前版本：V1.0.0.7
修改日期：2014-09-29


★使用demo时候，请先更改账号密码，webservice地址等参数
*/
global $defhandle,$arrret,$statuscode,$pginface,$soapinface,$signlens,$pageurl,$username,$password;
//账号密码
$username = 'J50601';
$password = '598712';
$signlens = 0;
//页面地址  127.0.0.1:7890   192.169.1.143:8086
$pageurl = 'http://61.130.7.220:8023/MWGate/wmgw.asmx';
//soap接口
$soapinface = array('MongateSendSubmit', 'MongateGetDeliver', 'MongateGetDeliver', 'MongateQueryBalance','MongateGetDeliver', 'MongateMULTIXSend');
//POST,GET请求接口
$pginface = array('MongateSendSubmit', 'MongateGetDeliver', 'MongateGetDeliver', 'MongateQueryBalance','MongateGetDeliver', 'MongateMULTIXSend');
//接口排序
//$defhandle = 0;
$defhandle = 5;//默认发送短信
//POST,GET请求返回字段
$arrret = array('string', 'string', 'string', 'int', 'string', 'string');
//错误码
$statuscode = array(
		"-1" => "参数为空。信息、电话号码等有空指针，登陆失败",
		"-2" => "电话号码个数超过100",
		"-10" => "申请缓存空间失败",
		"-11" => "电话号码中有非数字字符",
		"-12" => "有异常电话号码",
		"-13" => "电话号码个数与实际个数不相等",
		"-14" => "实际号码个数超过100",
		"-101" => "发送消息等待超时",
		"-102" => "发送或接收消息失败",
		"-103" => "接收消息超时",
		"-200" => "其他错误",
		"-999" => "web服务器内部错误",
		"-10001" => "用户登陆不成功",
		"-10002" => "提交格式不正确",
		"-10003" => "用户余额不足",
		"-10004" => "手机号码不正确",
		"-10005" => "计费用户帐号错误",
		"-10006" => "计费用户密码错",
		"-10007" => "账号已经被停用",
		"-10008" => "账号类型不支持该功能",
		"-10009" => "其它错误",
		"-10010" => "企业代码不正确",
		"-10011" => "信息内容超长",
		"-10012" => "不能发送联通号码",
		"-10013" => "操作员权限不够",
		"-10014" => "费率代码不正确",
		"-10015" => "服务器繁忙",
		"-10016" => "企业权限不够",
		"-10017" => "此时间段不允许发送",
		"-10018" => "经销商用户名或密码错",
		"-10019" => "手机列表或规则错误",
		"-10021" => "没有开停户权限",
		"-10022" => "没有转换用户类型的权限",
		"-10023" => "没有修改用户所属经销商的权限",
		"-10024" => "经销商用户名或密码错",
		"-10025" => "操作员登陆名或密码错误",
		"-10026" => "操作员所充值的用户不存在",
		"-10027" => "操作员没有充值商务版的权限",
		"-10028" => "该用户没有转正不能充值",
		"-10029" => "此用户没有权限从此通道发送信息",
		"-10030" => "不能发送移动号码",
		"-10031" => "手机号码(段)非法",
		"-10032" => "用户使用的费率代码错误",
		"-10033" => "非法关键词"
	);

?>